IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Cross-section defined by parameters

IdeaRS.OpenModel.CrossSection.CrossSectionParameter.#ctor
Constructor

IdeaRS.OpenModel.CrossSection.CrossSectionParameter.CrossSectionType
Type of cross-section

IdeaRS.OpenModel.CrossSection.CrossSectionParameter.Parameters
Parameters

IdeaRS.OpenModel.CrossSection.CrossSectionParameter.Material
Material